using System;

namespace _2023._01._02_포커게임
{
    public class Program
    {
        static void Main(string[] args)
        {
            //  LAB. 포커게임

            //  * 컴퓨터와 플레이어가 5장의 카드를 뽑는다.
            //  * 플레이어가 배팅을 한다. (최초 소지금 = 10,000 포인트)
            //  * 컴퓨터는 추가로 2장의 카드를 받는다.
            //  * 플레이어는 최대 2장의 카드를 교체할 수 있다.
            //  * 모든 액션이 끝난 후에는 결과를 체크한다.
            //  * 플레이어 승리시 배팅 금액의 2배를 얻는다.
            //  * 플레이어의 소지금이 100,000 포인트 이상이 되거나 전부 잃으면 게임을 종료한다.
            //  * 족보 : Top ~ straight (기본형)
            //  * 전체 족보 (도전)
        }
    }
}